---
kind: method
id: M:Autodesk.Revit.DB.DXFExportOptions.#ctor(Autodesk.Revit.DB.DXFExportOptions)
source: html/9c56f903-e882-d390-5937-44c5432f9486.htm
---
# Autodesk.Revit.DB.DXFExportOptions.#ctor Method

Constructs a new instance of DXFImportOptions as a copy of the export options.

## Syntax (C#)
```csharp
public DXFExportOptions(
	DXFExportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.DXFExportOptions`) - The options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null